9/data/attachments/1cd205c4f46f6e7c.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Michelle_nature_Friend_19026_5</nif:username>
            <nif:friendToBeRequested>soap_friends_60a94ffb-b0d2-4575-90f7-06309ce18dc4</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>